/**
 * K好数：当且仅当这个数字可以表示若干个不同的K的幂只和
 * 例如： 17 是4的k好数  17 = 4**2 + 4**0
 * 求[1,r]范围上，有多少个K好数，共有q次询问
 * 例如 16 - 21
 * 转成二进制形式表示
 * 16 = 4 ** 2  -> 100 -> 4 ** 2 * 1 + 4 * 1 * 0 + 4 * 0 * 0
 * 17 = 4 ** 2 + 4 ** 0 :  -> 101 -> 4 ** 2 + 4 ** 0 * 1
 * 20 = 4 ** 2 + 4 ** 1 :  -> 110 -> 4 ** 2 + 4 ** 1
 * 21 = 4 ** 2 + 4 ** 1 + 4 ** 0 : -> 111
 */

let kNum = (l, r, k) => {
  let res = 0
  // 16
  for (let i = l; i < r; i++) {
    // k ** 0 = 1
    // k ** 1 = 4
    // k ** 2 =
    // .....
    // k ** j =
    for (let j = 0; k ** j <= i; j++) {
      let num = Math.log(i) / Math.log(j)
      if (num % 1 === 0 || i - (k ** j) === 1) {
        res++
        console.log("kNum", k, j)
      }
    }
  }
}

// kNum(17)
